# Simple Linear Regression - HR Analytics

In [1]:
import pandas as pd

Approach for building a regression problem in Python

1) Read and access the data

2) Identify the independent and dependent variables

3) Splliting the data into train and test

4) Building the model

5) Identify the equation using the slope and intercept and find R-Sqaured

6) Predict the test data, using your model

In [4]:
ctc = pd.read_csv(r'C:\Users\Laxman\OneDrive\Desktop\Data Files_1\CTCdata- Dataset.csv')
ctc

,CTCoffered,LastCTC,Interview rating,Skill Set Index,Highest qualification,Total years of work exp
0,19,18,4,3,3,8.5
1,17,16,4,3,3,7.7
2,17,16,4,3,3,7.9
3,9,8,3,1,2,2.7
4,10,9,5,4,4,9.7
...,...,...,...,...,...,...
186,7,5,4,2,2,5.5
187,21,19,3,2,2,5.3
188,14,14,5,4,4,10.3
189,10,8,5,4,4,9.5
190,15,15,4,3,3,7.7

In [6]:
ctc_new = ctc[['CTCoffered','LastCTC']]
ctc_new.head()

   CTCoffered  LastCTC
0          19       18
1          17       16
2          17       16
3           9        8
4          10        9

In [7]:
x = ctc_new[['LastCTC']]
y = ctc_new[['CTCoffered']]
x.head()

   LastCTC
0       18
1       16
2       16
3        8
4        9

In [8]:
y.head()

   CTCoffered
0          19
1          17
2          17
3           9
4          10

# Splitting the data into train and test

In [9]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,train_size=0.8,random_state=42)
len(x_train),len(x_test),len(y_train),len(y_test)

(152, 39, 152, 39)

In [10]:
x_train.head()

     LastCTC
35        18
100        9
55        11
135       15
78         6

# Building a linear regression

In [11]:
from sklearn.linear_model import LinearRegression

In [12]:
lr = LinearRegression()
model = lr.fit(x_train,y_train)

In [13]:
#To find the slope, we would use the coef_ function
model.coef_

array([[0.9401281]])

In [14]:
#To find the constant, we would use intercept_ function
model.intercept_

array([1.80548038])

In [15]:
#To find the R-square value, we will use the score function
model.score(x_train,y_train)

0.9709568208423041

In [17]:
CTC = (0.94*10)+1.8
CTC

11.2

# Predicting on test data

In [18]:
y_test.head()

     CTCoffered
152          18
75           21
158           8
66           17
60           17

In [19]:
y_test['Predicted CTC'] = model.predict(x_test)
y_test.head()

     CTCoffered  Predicted CTC
152          18      17.787658
75           21      20.608042
158           8       7.446249
66           17      16.847530
60           17      16.847530

# Evaluating the model by finding out the RMSE value

RMSE - Root Mean Squared Error

In [20]:
y_test['Error'] = y_test['CTCoffered'] - y_test['Predicted CTC']
y_test.head()

     CTCoffered  Predicted CTC     Error
152          18      17.787658  0.212342
75           21      20.608042  0.391958
158           8       7.446249  0.553751
66           17      16.847530  0.152470
60           17      16.847530  0.152470

In [21]:
y_test['Sqaured_Error'] = y_test['Error']**2
y_test.head()

     CTCoffered  Predicted CTC     Error  Sqaured_Error
152          18      17.787658  0.212342       0.045089
75           21      20.608042  0.391958       0.153631
158           8       7.446249  0.553751       0.306640
66           17      16.847530  0.152470       0.023247
60           17      16.847530  0.152470       0.023247

In [22]:
mse = y_test['Sqaured_Error'].mean()
mse

0.5104422481086017

In [23]:
from math import sqrt
rmse = sqrt(mse)
rmse

0.7144524113673364

Let assume a candidate with 12 lakhs salary get selected. What would be the predicted ctc

In [24]:
pred_salary = model.predict([[14]])
pred_salary

C:\Users\Laxman\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[14.96727382]])

In [25]:
upper_band = pred_salary+rmse
lower_band = pred_salary-rmse

In [28]:
upper_band

array([[15.68172623]])

In [27]:

lower_band

array([[14.25282141]])